---
tags:
  - Практика
  - ЯзыкПрограммирования
  - Python
---
Напишите программу, которая выведет на экран квадраты всех целых чисел от 1 до 10.

**Подсказка**:

```python
i = 1

while i <= 10:
	print(i ** 2)
	i += 1
```
